; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=222, out_folder=./training, instance_id=34, seed=2058, goal_proportion=0.03

(define (problem blocksworld-34)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 - object)
 (:init 
    (arm-empty)
    (clear b79)
    (on b79 b30)
    (on b30 b112)
    (on-table b112)
    (clear b96)
    (on b96 b9)
    (on-table b9)
    (clear b171)
    (on-table b171)
    (clear b120)
    (on b120 b155)
    (on-table b155)
    (clear b44)
    (on b44 b132)
    (on b132 b163)
    (on-table b163)
    (clear b43)
    (on b43 b157)
    (on b157 b150)
    (on b150 b72)
    (on b72 b126)
    (on b126 b66)
    (on b66 b177)
    (on b177 b59)
    (on b59 b125)
    (on b125 b205)
    (on b205 b213)
    (on-table b213)
    (clear b103)
    (on b103 b55)
    (on b55 b217)
    (on b217 b104)
    (on b104 b186)
    (on b186 b192)
    (on b192 b42)
    (on b42 b143)
    (on b143 b194)
    (on b194 b154)
    (on b154 b27)
    (on b27 b222)
    (on b222 b5)
    (on b5 b3)
    (on b3 b16)
    (on b16 b212)
    (on b212 b167)
    (on b167 b93)
    (on b93 b12)
    (on b12 b210)
    (on b210 b201)
    (on b201 b198)
    (on-table b198)
    (clear b148)
    (on b148 b137)
    (on-table b137)
    (clear b160)
    (on-table b160)
    (clear b184)
    (on-table b184)
    (clear b80)
    (on b80 b10)
    (on b10 b141)
    (on b141 b175)
    (on b175 b161)
    (on b161 b122)
    (on b122 b197)
    (on-table b197)
    (clear b37)
    (on b37 b52)
    (on b52 b28)
    (on-table b28)
    (clear b107)
    (on-table b107)
    (clear b74)
    (on-table b74)
    (clear b60)
    (on b60 b169)
    (on b169 b153)
    (on-table b153)
    (clear b4)
    (on b4 b146)
    (on b146 b32)
    (on b32 b136)
    (on b136 b65)
    (on-table b65)
    (clear b48)
    (on-table b48)
    (clear b14)
    (on b14 b220)
    (on-table b220)
    (clear b41)
    (on-table b41)
    (clear b130)
    (on b130 b203)
    (on b203 b8)
    (on b8 b144)
    (on-table b144)
    (clear b182)
    (on b182 b202)
    (on-table b202)
    (clear b58)
    (on b58 b164)
    (on b164 b33)
    (on b33 b83)
    (on b83 b200)
    (on b200 b156)
    (on b156 b23)
    (on b23 b18)
    (on-table b18)
    (clear b17)
    (on b17 b140)
    (on b140 b19)
    (on b19 b31)
    (on b31 b68)
    (on b68 b24)
    (on b24 b142)
    (on b142 b204)
    (on-table b204)
    (clear b102)
    (on b102 b87)
    (on b87 b63)
    (on b63 b1)
    (on b1 b117)
    (on-table b117)
    (clear b183)
    (on b183 b134)
    (on b134 b90)
    (on b90 b61)
    (on b61 b165)
    (on-table b165)
    (clear b195)
    (on b195 b70)
    (on b70 b113)
    (on-table b113)
    (clear b49)
    (on-table b49)
    (clear b92)
    (on b92 b193)
    (on b193 b88)
    (on-table b88)
    (clear b145)
    (on b145 b97)
    (on-table b97)
    (clear b158)
    (on b158 b47)
    (on b47 b129)
    (on b129 b81)
    (on b81 b46)
    (on b46 b45)
    (on b45 b181)
    (on b181 b211)
    (on-table b211)
    (clear b94)
    (on b94 b189)
    (on b189 b116)
    (on-table b116)
    (clear b207)
    (on-table b207)
    (clear b149)
    (on b149 b168)
    (on b168 b118)
    (on b118 b108)
    (on b108 b13)
    (on b13 b109)
    (on b109 b190)
    (on b190 b71)
    (on b71 b174)
    (on b174 b36)
    (on b36 b221)
    (on b221 b89)
    (on b89 b114)
    (on b114 b11)
    (on b11 b216)
    (on b216 b57)
    (on b57 b39)
    (on b39 b135)
    (on-table b135)
    (clear b172)
    (on b172 b162)
    (on-table b162)
    (clear b170)
    (on-table b170)
    (clear b20)
    (on b20 b214)
    (on b214 b106)
    (on-table b106)
    (clear b22)
    (on-table b22)
    (clear b191)
    (on b191 b138)
    (on b138 b85)
    (on b85 b121)
    (on b121 b219)
    (on-table b219)
    (clear b196)
    (on-table b196)
    (clear b84)
    (on b84 b101)
    (on b101 b131)
    (on b131 b77)
    (on b77 b124)
    (on b124 b110)
    (on-table b110)
    (clear b209)
    (on b209 b123)
    (on-table b123)
    (clear b75)
    (on b75 b51)
    (on b51 b53)
    (on b53 b173)
    (on-table b173)
    (clear b159)
    (on b159 b50)
    (on b50 b98)
    (on b98 b95)
    (on b95 b26)
    (on b26 b78)
    (on b78 b38)
    (on-table b38)
    (clear b25)
    (on-table b25)
    (clear b128)
    (on b128 b34)
    (on-table b34)
    (clear b76)
    (on b76 b188)
    (on b188 b100)
    (on b100 b208)
    (on b208 b133)
    (on b133 b206)
    (on b206 b64)
    (on b64 b199)
    (on b199 b21)
    (on-table b21)
    (clear b91)
    (on-table b91)
    (clear b166)
    (on-table b166)
    (clear b139)
    (on b139 b54)
    (on b54 b86)
    (on b86 b7)
    (on b7 b180)
    (on b180 b73)
    (on b73 b179)
    (on b179 b119)
    (on-table b119)
    (clear b2)
    (on-table b2)
    (clear b176)
    (on b176 b67)
    (on b67 b147)
    (on b147 b6)
    (on b6 b218)
    (on b218 b111)
    (on-table b111)
    (clear b62)
    (on-table b62)
    (clear b127)
    (on b127 b99)
    (on b99 b151)
    (on b151 b69)
    (on-table b69)
    (clear b115)
    (on b115 b152)
    (on b152 b215)
    (on b215 b35)
    (on-table b35)
    (clear b82)
    (on-table b82)
    (clear b56)
    (on b56 b185)
    (on-table b185)
    (clear b105)
    (on b105 b187)
    (on-table b187)
    (clear b178)
    (on b178 b29)
    (on b29 b15)
    (on-table b15)
    (clear b40)
    (on-table b40))
 (:goal  (and 
    (clear b1)
    (on b1 b6)
    (on b6 b4)
    (on b4 b5)
    (on-table b5)
    (clear b2)
    (on b2 b3)
    (on-table b3))))

; plan
1. (unstack b102 b87)
   deleted: (on b102 b87) (clear b102) (arm-empty)
   added: (holding b102) (clear b87)
   goals met: 1 of 8
2. (putdown b102)
   deleted: (holding b102)
   added: (clear b102) (arm-empty) (on-table b102)
   goals met: 1 of 8
3. (unstack b103 b55)
   deleted: (on b103 b55) (clear b103) (arm-empty)
   added: (holding b103) (clear b55)
   goals met: 1 of 8
4. (putdown b103)
   deleted: (holding b103)
   added: (clear b103) (arm-empty) (on-table b103)
   goals met: 1 of 8
5. (unstack b176 b67)
   deleted: (on b176 b67) (clear b176) (arm-empty)
   added: (holding b176) (clear b67)
   goals met: 1 of 8
6. (putdown b176)
   deleted: (holding b176)
   added: (clear b176) (arm-empty) (on-table b176)
   goals met: 1 of 8
7. (unstack b55 b217)
   deleted: (on b55 b217) (clear b55) (arm-empty)
   added: (holding b55) (clear b217)
   goals met: 1 of 8
8. (putdown b55)
   deleted: (holding b55)
   added: (clear b55) (arm-empty) (on-table b55)
   goals met: 1 of 8
9. (unstack b217 b104)
   deleted: (on b217 b104) (clear b217) (arm-empty)
   added: (holding b217) (clear b104)
   goals met: 1 of 8
10. (putdown b217)
   deleted: (holding b217)
   added: (clear b217) (arm-empty) (on-table b217)
   goals met: 1 of 8
11. (unstack b104 b186)
   deleted: (on b104 b186) (clear b104) (arm-empty)
   added: (holding b104) (clear b186)
   goals met: 1 of 8
12. (putdown b104)
   deleted: (holding b104)
   added: (clear b104) (arm-empty) (on-table b104)
   goals met: 1 of 8
13. (unstack b186 b192)
   deleted: (on b186 b192) (clear b186) (arm-empty)
   added: (holding b186) (clear b192)
   goals met: 1 of 8
14. (putdown b186)
   deleted: (holding b186)
   added: (clear b186) (arm-empty) (on-table b186)
   goals met: 1 of 8
15. (unstack b192 b42)
   deleted: (on b192 b42) (clear b192) (arm-empty)
   added: (holding b192) (clear b42)
   goals met: 1 of 8
16. (putdown b192)
   deleted: (holding b192)
   added: (clear b192) (arm-empty) (on-table b192)
   goals met: 1 of 8
17. (unstack b42 b143)
   deleted: (on b42 b143) (clear b42) (arm-empty)
   added: (holding b42) (clear b143)
   goals met: 1 of 8
18. (putdown b42)
   deleted: (holding b42)
   added: (clear b42) (arm-empty) (on-table b42)
   goals met: 1 of 8
19. (unstack b143 b194)
   deleted: (on b143 b194) (clear b143) (arm-empty)
   added: (holding b143) (clear b194)
   goals met: 1 of 8
20. (putdown b143)
   deleted: (holding b143)
   added: (clear b143) (arm-empty) (on-table b143)
   goals met: 1 of 8
21. (unstack b194 b154)
   deleted: (on b194 b154) (clear b194) (arm-empty)
   added: (holding b194) (clear b154)
   goals met: 1 of 8
22. (putdown b194)
   deleted: (holding b194)
   added: (clear b194) (arm-empty) (on-table b194)
   goals met: 1 of 8
23. (unstack b154 b27)
   deleted: (on b154 b27) (clear b154) (arm-empty)
   added: (holding b154) (clear b27)
   goals met: 1 of 8
24. (putdown b154)
   deleted: (holding b154)
   added: (clear b154) (arm-empty) (on-table b154)
   goals met: 1 of 8
25. (unstack b27 b222)
   deleted: (on b27 b222) (clear b27) (arm-empty)
   added: (holding b27) (clear b222)
   goals met: 1 of 8
26. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 1 of 8
27. (unstack b222 b5)
   deleted: (on b222 b5) (clear b222) (arm-empty)
   added: (holding b222) (clear b5)
   goals met: 1 of 8
28. (putdown b222)
   deleted: (holding b222)
   added: (clear b222) (arm-empty) (on-table b222)
   goals met: 1 of 8
29. (unstack b5 b3)
   deleted: (on b5 b3) (clear b5) (arm-empty)
   added: (holding b5) (clear b3)
   goals met: 1 of 8
30. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 2 of 8
31. (unstack b3 b16)
   deleted: (on b3 b16) (clear b3) (arm-empty)
   added: (holding b3) (clear b16)
   goals met: 2 of 8
32. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 3 of 8
33. (unstack b67 b147)
   deleted: (on b67 b147) (clear b67) (arm-empty)
   added: (holding b67) (clear b147)
   goals met: 3 of 8
34. (putdown b67)
   deleted: (holding b67)
   added: (clear b67) (arm-empty) (on-table b67)
   goals met: 3 of 8
35. (unstack b147 b6)
   deleted: (on b147 b6) (clear b147) (arm-empty)
   added: (holding b147) (clear b6)
   goals met: 3 of 8
36. (putdown b147)
   deleted: (holding b147)
   added: (clear b147) (arm-empty) (on-table b147)
   goals met: 3 of 8
37. (unstack b87 b63)
   deleted: (on b87 b63) (clear b87) (arm-empty)
   added: (holding b87) (clear b63)
   goals met: 3 of 8
38. (putdown b87)
   deleted: (holding b87)
   added: (clear b87) (arm-empty) (on-table b87)
   goals met: 3 of 8
39. (unstack b63 b1)
   deleted: (on b63 b1) (clear b63) (arm-empty)
   added: (holding b63) (clear b1)
   goals met: 4 of 8
40. (putdown b63)
   deleted: (holding b63)
   added: (clear b63) (arm-empty) (on-table b63)
   goals met: 4 of 8
41. (unstack b4 b146)
   deleted: (on b4 b146) (clear b4) (arm-empty)
   added: (holding b4) (clear b146)
   goals met: 4 of 8
42. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 5 of 8
43. (unstack b6 b218)
   deleted: (on b6 b218) (clear b6) (arm-empty)
   added: (holding b6) (clear b218)
   goals met: 5 of 8
44. (stack b6 b4)
   deleted: (clear b4) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b4)
   goals met: 6 of 8
45. (unstack b1 b117)
   deleted: (on b1 b117) (clear b1) (arm-empty)
   added: (holding b1) (clear b117)
   goals met: 5 of 8
46. (stack b1 b6)
   deleted: (clear b6) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b6)
   goals met: 7 of 8
47. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 6 of 8
48. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 8 of 8
